Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
age (InputLayer)                [(None,)]            0                                            
__________________________________________________________________________________________________
trestbps (InputLayer)           [(None,)]            0                                            
__________________________________________________________________________________________________
chol (InputLayer)               [(None,)]            0                                            
__________________________________________________________________________________________________
thalach (InputLayer)            [(None,)]            0                                            
__________________________________________________________________________________________________
oldpeak (InputLayer)            [(None,)]            0                                            
__________________________________________________________________________________________________
slope (InputLayer)              [(None,)]            0                                            
__________________________________________________________________________________________________
normalization (Normalization)   (1, None)            3           age[0][0]                        
__________________________________________________________________________________________________
normalization_1 (Normalization) (1, None)            3           trestbps[0][0]                   
__________________________________________________________________________________________________
normalization_2 (Normalization) (1, None)            3           chol[0][0]                       
__________________________________________________________________________________________________
normalization_3 (Normalization) (1, None)            3           thalach[0][0]                    
__________________________________________________________________________________________________
normalization_4 (Normalization) (1, None)            3           oldpeak[0][0]                    
__________________________________________________________________________________________________
normalization_5 (Normalization) (1, None)            3           slope[0][0]                      
__________________________________________________________________________________________________
tf.expand_dims (TFOpLambda)     (1, None, 1)         0           normalization[0][0]              
__________________________________________________________________________________________________
tf.expand_dims_1 (TFOpLambda)   (1, None, 1)         0           normalization_1[0][0]            
__________________________________________________________________________________________________
tf.expand_dims_2 (TFOpLambda)   (1, None, 1)         0           normalization_2[0][0]            
__________________________________________________________________________________________________
tf.expand_dims_3 (TFOpLambda)   (1, None, 1)         0           normalization_3[0][0]            
__________________________________________________________________________________________________
tf.expand_dims_4 (TFOpLambda)   (1, None, 1)         0           normalization_4[0][0]            
__________________________________________________________________________________________________
tf.expand_dims_5 (TFOpLambda)   (1, None, 1)         0           normalization_5[0][0]            
__________________________________________________________________________________________________
sex (InputLayer)                [(None,)]            0                                            
__________________________________________________________________________________________________
cp (InputLayer)                 [(None,)]            0                                            
__________________________________________________________________________________________________
fbs (InputLayer)                [(None,)]            0                                            
__________________________________________________________________________________________________
restecg (InputLayer)            [(None,)]            0                                            
__________________________________________________________________________________________________
exang (InputLayer)              [(None,)]            0                                            
__________________________________________________________________________________________________
ca (InputLayer)                 [(None,)]            0                                            
__________________________________________________________________________________________________
thal (InputLayer)               [(None,)]            0                                            
__________________________________________________________________________________________________
tf.compat.v1.squeeze (TFOpLambd (None, 1)            0           tf.expand_dims[0][0]             
__________________________________________________________________________________________________
tf.compat.v1.squeeze_1 (TFOpLam (None, 1)            0           tf.expand_dims_1[0][0]           
__________________________________________________________________________________________________
tf.compat.v1.squeeze_2 (TFOpLam (None, 1)            0           tf.expand_dims_2[0][0]           
__________________________________________________________________________________________________
tf.compat.v1.squeeze_3 (TFOpLam (None, 1)            0           tf.expand_dims_3[0][0]           
__________________________________________________________________________________________________
tf.compat.v1.squeeze_4 (TFOpLam (None, 1)            0           tf.expand_dims_4[0][0]           
__________________________________________________________________________________________________
tf.compat.v1.squeeze_5 (TFOpLam (None, 1)            0           tf.expand_dims_5[0][0]           
__________________________________________________________________________________________________
string_lookup (StringLookup)    (None,)              0           sex[0][0]                        
__________________________________________________________________________________________________
string_lookup_1 (StringLookup)  (None,)              0           cp[0][0]                         
__________________________________________________________________________________________________
string_lookup_2 (StringLookup)  (None,)              0           fbs[0][0]                        
__________________________________________________________________________________________________
string_lookup_3 (StringLookup)  (None,)              0           restecg[0][0]                    
__________________________________________________________________________________________________
string_lookup_4 (StringLookup)  (None,)              0           exang[0][0]                      
__________________________________________________________________________________________________
string_lookup_5 (StringLookup)  (None,)              0           ca[0][0]                         
__________________________________________________________________________________________________
string_lookup_6 (StringLookup)  (None,)              0           thal[0][0]                       
__________________________________________________________________________________________________
dense (Dense)                   (None, 16)           32          tf.compat.v1.squeeze[0][0]       
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           32          tf.compat.v1.squeeze_1[0][0]     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 16)           32          tf.compat.v1.squeeze_2[0][0]     
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 16)           32          tf.compat.v1.squeeze_3[0][0]     
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           32          tf.compat.v1.squeeze_4[0][0]     
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 16)           32          tf.compat.v1.squeeze_5[0][0]     
__________________________________________________________________________________________________
embedding (Embedding)           (None, 16)           32          string_lookup[0][0]              
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 16)           80          string_lookup_1[0][0]            
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 16)           32          string_lookup_2[0][0]            
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 16)           48          string_lookup_3[0][0]            
__________________________________________________________________________________________________
embedding_4 (Embedding)         (None, 16)           32          string_lookup_4[0][0]            
__________________________________________________________________________________________________
embedding_5 (Embedding)         (None, 16)           64          string_lookup_5[0][0]            
__________________________________________________________________________________________________
embedding_6 (Embedding)         (None, 16)           80          string_lookup_6[0][0]            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 208)          0           dense[0][0]                      
                                                                 dense_1[0][0]                    
                                                                 dense_2[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_4[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 embedding[0][0]                  
                                                                 embedding_1[0][0]                
                                                                 embedding_2[0][0]                
                                                                 embedding_3[0][0]                
                                                                 embedding_4[0][0]                
                                                                 embedding_5[0][0]                
                                                                 embedding_6[0][0]                
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 32)           6688        concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1)            33          dropout[0][0]                    
==================================================================================================
Total params: 7,299
Trainable params: 7,281
Non-trainable params: 18