Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
age (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
trestbps (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
chol (InputLayer)               [(None, 1)]          0                                            
__________________________________________________________________________________________________
thalach (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
oldpeak (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
slope (InputLayer)              [(None, 1)]          0                                            
__________________________________________________________________________________________________
sex (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
cp (InputLayer)                 [(None, 1)]          0                                            
__________________________________________________________________________________________________
fbs (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
restecg (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
exang (InputLayer)              [(None, 1)]          0                                            
__________________________________________________________________________________________________
ca (InputLayer)                 [(None, 1)]          0                                            
__________________________________________________________________________________________________
thal (InputLayer)               [(None, 1)]          0                                            
__________________________________________________________________________________________________
normalization (Normalization)   (None, 1)            3           age[0][0]                        
__________________________________________________________________________________________________
normalization_1 (Normalization) (None, 1)            3           trestbps[0][0]                   
__________________________________________________________________________________________________
normalization_2 (Normalization) (None, 1)            3           chol[0][0]                       
__________________________________________________________________________________________________
normalization_3 (Normalization) (None, 1)            3           thalach[0][0]                    
__________________________________________________________________________________________________
normalization_4 (Normalization) (None, 1)            3           oldpeak[0][0]                    
__________________________________________________________________________________________________
normalization_5 (Normalization) (None, 1)            3           slope[0][0]                      
__________________________________________________________________________________________________
string_lookup_1 (StringLookup)  (None, 3)            0           sex[0][0]                        
__________________________________________________________________________________________________
string_lookup_3 (StringLookup)  (None, 6)            0           cp[0][0]                         
__________________________________________________________________________________________________
string_lookup_5 (StringLookup)  (None, 3)            0           fbs[0][0]                        
__________________________________________________________________________________________________
string_lookup_7 (StringLookup)  (None, 4)            0           restecg[0][0]                    
__________________________________________________________________________________________________
string_lookup_9 (StringLookup)  (None, 3)            0           exang[0][0]                      
__________________________________________________________________________________________________
string_lookup_11 (StringLookup) (None, 5)            0           ca[0][0]                         
__________________________________________________________________________________________________
string_lookup_13 (StringLookup) (None, 6)            0           thal[0][0]                       
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 36)           0           normalization[0][0]              
                                                                 normalization_1[0][0]            
                                                                 normalization_2[0][0]            
                                                                 normalization_3[0][0]            
                                                                 normalization_4[0][0]            
                                                                 normalization_5[0][0]            
                                                                 string_lookup_1[0][0]            
                                                                 string_lookup_3[0][0]            
                                                                 string_lookup_5[0][0]            
                                                                 string_lookup_7[0][0]            
                                                                 string_lookup_9[0][0]            
                                                                 string_lookup_11[0][0]           
                                                                 string_lookup_13[0][0]           
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           1184        concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32)           0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            33          dropout[0][0]                    
==================================================================================================
Total params: 1,235
Trainable params: 1,217
Non-trainable params: 18