Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
workclass (InputLayer)          [(None,)]            0                                            
__________________________________________________________________________________________________
education (InputLayer)          [(None,)]            0                                            
__________________________________________________________________________________________________
marital_status (InputLayer)     [(None,)]            0                                            
__________________________________________________________________________________________________
occupation (InputLayer)         [(None,)]            0                                            
__________________________________________________________________________________________________
relationship (InputLayer)       [(None,)]            0                                            
__________________________________________________________________________________________________
race (InputLayer)               [(None,)]            0                                            
__________________________________________________________________________________________________
gender (InputLayer)             [(None,)]            0                                            
__________________________________________________________________________________________________
native_country (InputLayer)     [(None,)]            0                                            
__________________________________________________________________________________________________
age (InputLayer)                [(None,)]            0                                            
__________________________________________________________________________________________________
education_num (InputLayer)      [(None,)]            0                                            
__________________________________________________________________________________________________
capital_gain (InputLayer)       [(None,)]            0                                            
__________________________________________________________________________________________________
capital_loss (InputLayer)       [(None,)]            0                                            
__________________________________________________________________________________________________
hours_per_week (InputLayer)     [(None,)]            0                                            
__________________________________________________________________________________________________
tf.expand_dims_5 (TFOpLambda)   (None, 1)            0           workclass[0][0]                  
__________________________________________________________________________________________________
tf.expand_dims_6 (TFOpLambda)   (None, 1)            0           education[0][0]                  
__________________________________________________________________________________________________
tf.expand_dims_7 (TFOpLambda)   (None, 1)            0           marital_status[0][0]             
__________________________________________________________________________________________________
tf.expand_dims_8 (TFOpLambda)   (None, 1)            0           occupation[0][0]                 
__________________________________________________________________________________________________
tf.expand_dims_9 (TFOpLambda)   (None, 1)            0           relationship[0][0]               
__________________________________________________________________________________________________
tf.expand_dims_10 (TFOpLambda)  (None, 1)            0           race[0][0]                       
__________________________________________________________________________________________________
tf.expand_dims_11 (TFOpLambda)  (None, 1)            0           gender[0][0]                     
__________________________________________________________________________________________________
tf.expand_dims_12 (TFOpLambda)  (None, 1)            0           native_country[0][0]             
__________________________________________________________________________________________________
tf.expand_dims (TFOpLambda)     (None, 1)            0           age[0][0]                        
__________________________________________________________________________________________________
tf.expand_dims_1 (TFOpLambda)   (None, 1)            0           education_num[0][0]              
__________________________________________________________________________________________________
tf.expand_dims_2 (TFOpLambda)   (None, 1)            0           capital_gain[0][0]               
__________________________________________________________________________________________________
tf.expand_dims_3 (TFOpLambda)   (None, 1)            0           capital_loss[0][0]               
__________________________________________________________________________________________________
tf.expand_dims_4 (TFOpLambda)   (None, 1)            0           hours_per_week[0][0]             
__________________________________________________________________________________________________
string_lookup (StringLookup)    (None, 9)            0           tf.expand_dims_5[0][0]           
__________________________________________________________________________________________________
string_lookup_1 (StringLookup)  (None, 16)           0           tf.expand_dims_6[0][0]           
__________________________________________________________________________________________________
string_lookup_2 (StringLookup)  (None, 7)            0           tf.expand_dims_7[0][0]           
__________________________________________________________________________________________________
string_lookup_3 (StringLookup)  (None, 15)           0           tf.expand_dims_8[0][0]           
__________________________________________________________________________________________________
string_lookup_4 (StringLookup)  (None, 6)            0           tf.expand_dims_9[0][0]           
__________________________________________________________________________________________________
string_lookup_5 (StringLookup)  (None, 5)            0           tf.expand_dims_10[0][0]          
__________________________________________________________________________________________________
string_lookup_6 (StringLookup)  (None, 2)            0           tf.expand_dims_11[0][0]          
__________________________________________________________________________________________________
string_lookup_7 (StringLookup)  (None, 42)           0           tf.expand_dims_12[0][0]          
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 107)          0           tf.expand_dims[0][0]             
                                                                 tf.expand_dims_1[0][0]           
                                                                 tf.expand_dims_2[0][0]           
                                                                 tf.expand_dims_3[0][0]           
                                                                 tf.expand_dims_4[0][0]           
                                                                 string_lookup[0][0]              
                                                                 string_lookup_1[0][0]            
                                                                 string_lookup_2[0][0]            
                                                                 string_lookup_3[0][0]            
                                                                 string_lookup_4[0][0]            
                                                                 string_lookup_5[0][0]            
                                                                 string_lookup_6[0][0]            
                                                                 string_lookup_7[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           3456        concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32)           0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            33          dropout[0][0]                    
==================================================================================================
Total params: 3,489
Trainable params: 3,489
Non-trainable params: 0